//Напишите программу, которая на вход принимает 2 числа и выдает какое число больше, а какое меньше
Console.WriteLine("Ведите первую цифру" );
int numberA = -9;
Console.ReadLine();
Console.WriteLine("Введите вторую цифру" );
int numberB = -3;
Console.ReadLine();
if (numberA > numberB)
{
    Console.WriteLine("Первое число больше второго числа ");
}
else
{
    Console.WriteLine("Второе число больше первого числа" );
}        



